#Title: Emacs Configuration
/#+PROPERTY: header-args :tangle ~/.config/emacs/init.el 
#+auto_tangle: t


* Developer Interaction
This class of settings I think of as those that I need in order to work best with the editor.  How can I commicate. Plugins that affect how I communicate via keybindings, mouse, whatever should go here.

#+BEGIN_SRC emacs-lisp 
    (use-package undo-tree
      :ensure t
      :config
      (setq undo-true-auto-save-history nil)
      (global-undo-tree-mode 1))


    (use-package evil
    :init
    (setq evil-want-fine-under t)
    (setq evil-want-keybinding nil)
    (setq evil-want-Y-yank-to-eol t)
    :config

    (evil-set-initial-state 'dashboard-mode 'motion)
    (evil-set-initial-state 'debugger-mode 'motion)
    (evil-set-initial-state 'pdf-view-mode 'motion)
    (evil-set-initial-state 'bufler-list-mode 'emacs)
    (evil-set-initial-state 'inferior-python-mode 'emacs)
    (evil-set-initial-state 'term-mode 'emacs)
    (evil-set-initial-state 'calc-mode 'emacs)

    ;; ----- Keybindings
    ;; I tried using evil-define-key for these. Didn't work.
    (define-key evil-window-map "\C-q" 'evil-delete-buffer) ;; Maps C-w C-q to evil-delete-buffer (The first C-w puts you into evil-window-map)
    (define-key evil-window-map "\C-w" 'kill-this-buffer)
    (define-key evil-motion-state-map "\C-b" 'evil-scroll-up) ;; Makes C-b how C-u is

    ;; ----- Setting cursor colors
    (setq evil-emacs-state-cursor    '("#649bce" box))
    (setq evil-normal-state-cursor   '("#d9a871" box))
    (setq evil-operator-state-cursor '("#ebcb8b" hollow))
    (setq evil-visual-state-cursor   '("#677691" box))
    (setq evil-insert-state-cursor   '("#eb998b" (bar . 2)))
    (setq evil-replace-state-cursor  '("#eb998b" hbar))
    (setq evil-motion-state-cursor   '("#ad8beb" box))
    (evil-mode +1))
  (use-package evil-collection
    :after evil
    :config
    (setq evil-collection-mode-list '(dired (custom cus-edit) (package-menu package) calc diff-mode))
    (evil-collection-init))
#+END_SRC

#+RESULTS:
| (lambda nil (let ((color (cond ((minibufferp) '(#000000 . #ffffff)) ((evil-insert-state-p) '(#ffffff . #0000ff)) ((evil-emacs-state-p) '(#444488 . #ffffff)) ((buffer-modified-p) '(#0000ff . #ffffff)) (t '(#000000 . #ffffff))))) (set-face-background 'mode-line (car color)) (set-face-foreground 'mode-line (cdr color))))     | evil-repeat-post-hook |

** Rainbow delim
#+begin_src emacs-lisp 
  (use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
  #+end_src

  #+RESULTS:
  | rainbow-delimiters-mode |


** Auto :tangle org files
#+begin_src emacs-lisp 
  (use-package org-auto-tangle
    :defer t
    :hook (org-mode . org-auto-tangle-mode)
    :config
    (setq org-auto-tangle-default t))
  #+end_src

  #+RESULTS:
  | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | org-auto-tangle-mode | rc/org-mode-setup |


*** Language server
First we configure the LSP mode =typescript-mode=. This will be replaced by =typescript-ts-mode= but that uses tree-sitter and for some reason I can't get that to compile. We install and enable tree-sitter support. Then we define a new mode =Typescript TSX= mode that is a combination of =typescript-mode= and =typescriptreact-mode= (for tsx files).  We then tell treesitter that both tsx and ts should be treated the same.
#+begin_src emacs-lisp 
 #+end_src

 #+RESULTS:
 | (closure (t) nil (tsi-typescript-mode 1)) | lsp-deferred |

*** TSI.el
=tsi.el= provides a tree-sitter powered set of indentation rules for ts, json, and css files
#+begin_src emacs-lisp 
(use-package tsi
      :after tree-sitter
      :quelpa (tsi :fetcher github :repo "orzechowskid/tsi.el")
      ;; define autoload definitions which when actually invoked will cause package to be loaded
      :commands (tsi-typescript-mode tsi-json-mode tsi-css-mode)
      :init
      (add-hook 'typescript-mode-hook (lambda () (tsi-typescript-mode 1)))
      (add-hook 'json-mode-hook (lambda () (tsi-json-mode 1)))
      (add-hook 'css-mode-hook (lambda () (tsi-css-mode 1)))
      (add-hook 'scss-mode-hook (lambda () (tsi-scss-mode 1))))
#+end_src

#+RESULTS:
| lambda  | nil | (tsi-scss-mode 1) |                   |
| closure | (t) | nil               | (tsi-scss-mode 1) |

** Install Company Mode
#+begin_src emacs-lisp :tangle  yes
  (use-package company
    :after lsp-mode
    :hook (prog-mode . company-mode)
    :bind (:map company-active-map
                ("<tab>" . compnay-complete-selection))
    (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))

  #+end_src

  #+RESULTS:
  | company-box-mode | company-mode-set-explicitly | compnay-box-mode |

** Add LSP UI
#+begin_src emacs-lisp 
    (use-package lsp-ui
      :hook (lsp-mode . lsp-ui-mode)
      :config
  (setq lsp-ui-sideline-enable t)
  (setq lso-ui-sideline-show-hover t)
    (setq lsp-ui-doc-position 'bottom))
#+end_src

#+RESULTS:
| lsp-ui-mode |

** Tab Widths
Default to an indentation size of 2
#+begin_src emacs-lisp 
(setq-default tab-width 2)
(setq-default evil-shift-width tab-width)
#+end_src

#+RESULTS:
: 2

